import { nanoid } from "nanoid";

export const oldInclusiveChartsData = {
  res: {
    id: "c",
    size: "ml",
    location: { x: 0, y: 4 },
    title: "Перегляд по окремим районам та громадам",
    chartConfig: {
      options: {
        chart: {
          id: "bar-chart",
        },
        plotOptions: {
          bar: {
            horizontal: false,
          },
        },
        yaxis: {
          min: 0,
          max: 100,
        },
        xaxis: {
          categories: [
            "Пандус",
            "Місце для тимчасового перебування",
            "Сходи з поручнями",
            "Санітарні кімнати",
            "Матеріали надруковані шрифтом Брайля",
            "Технічні рішення для обслуговування осіб",
          ],
          labels: {
            hideOverlappingLabels: true,
            maxHeight: 100,
            trim: true,
          },
        },
      },
      data: {
        Всі: {
          Всі: {
            Всі: [{ data: [60, 50, 40, 60, 15, 5] }],
          },
        },
        Берігівський: {
          Всі: {
            Всі: [{ data: [58, 41, 33, 50, 0, 0] }],
          },
          Великобийганська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Вилоцька: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Виноградівська: {
            Всі: [{ data: [100, 0, 0, 100, 0, 0] }],
          },
          Батівська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Пийтерфолівська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Королівська: {
            Всі: [{ data: [100, 0, 0, 0, 0, 0] }],
          },
          Великоберезька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Камянська: {
            Всі: [{ data: [0, 0, 0, 100, 0, 0] }],
          },
          Берегівська: {
            Всі: [{ data: [100, 100, 0, 0, 0, 0] }],
          },
          Косоньска: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Мукачівський: {
          Всі: {
            Всі: [{ data: [71, 68, 43, 53, 6, 3] }],
          },
          Івановецька: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Полянська: {
            Всі: [{ data: [100, 33, 100, 100, 0, 0] }],
            ВРМ: [{ data: [100, 20, 100, 100, 0, 0] }],
          },
          Мукачівська: {
            Всі: [{ data: [80, 86, 13, 33, 6, 6] }],
            ВРМ: [{ data: [85, 85, 7, 28, 0, 0] }],
          },
          Верхньокоропецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Неліпинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Великолучівська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Горондівська: {
            Всі: [{ data: [100, 100, 100, 100, 100, 0] }],
          },
          Жденіївська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Кольчинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Нижньоворітська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Свалявська: {
            Всі: [{ data: [0, 100, 100, 0, 0, 0] }],
          },
          Чинадіївська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Воловецька: {
            Всі: [{ data: [0, 100, 0, 100, 0, 0] }],
          },
        },
        Рахівський: {
          Всі: {
            Всі: [{ data: [10, 30, 10, 10, 0, 10] }],
          },
          Великобичківська: {
            Всі: [{ data: [0, 14, 0, 0, 0, 0] }],
          },
          Рахівська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Ясінянська: {
            Всі: [{ data: [0, 100, 0, 0, 0, 100] }],
          },
          Богданська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Тячівський: {
          Всі: {
            Всі: [{ data: [71, 42, 57, 57, 7, 7] }],
          },
          "Усть-Чорнянська": {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Углянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Вільховецька: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Нересницька: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Бедевлянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Тячівська: {
            Всі: [{ data: [75, 25, 25, 75, 0, 0] }],
            ВРМ: [{ data: [66, 0, 0, 66, 0, 0] }],
          },
          Солотвинська: {
            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
          },
          Буштинська: {
            Всі: [{ data: [100, 0, 100, 100, 0, 0] }],
          },
          Дубівська: {
            Всі: [{ data: [100, 50, 100, 50, 50, 50] }],
            ВРМ: [{ data: [100, 0, 100, 0, 0, 0] }],
          },
          Тересвянська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
        },
        Ужгородський: {
          Всі: {
            Всі: [{ data: [60, 50, 40, 60, 15, 6] }],
          },
          Оноківська: {
            Всі: [{ data: [100, 0, 50, 100, 0, 0] }],
            ВРМ: [{ data: [100, 0, 0, 100, 0, 0] }],
          },
          Перечинська: {
            Всі: [{ data: [60, 80, 20, 40, 0, 0] }],
            ВРМ: [{ data: [50, 75, 0, 25, 0, 0] }],
          },
          "Турє-Реметівська": {
            Всі: [{ data: [100, 100, 0, 100, 0, 0] }],
            ВРМ: [{ data: [100, 100, 0, 100, 0, 0] }],
          },
          Чопська: {
            Всі: [{ data: [100, 0, 100, 100, 100, 0] }],
          },
          Середнянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Сюртівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          "Дубриницько-Малоберезнянська": {
            Всі: [{ data: [0, 100, 100, 100, 0, 0] }],
          },
          Костринська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Ставненьська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Ужгородська: {
            Всі: [{ data: [100, 100, 100, 100, 50, 50] }],
          },
          Холмківська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Баранинська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Великоберезнянська: {
            Всі: [{ data: [100, 100, 0, 100, 100, 0] }],
          },
          Великодобронська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Хустський: {
          Всі: {
            Всі: [{ data: [57, 47, 47, 38, 14, 4] }],
          },
          Колочавська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Драгівська: {
            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
          },
          Керецьківська: {
            Всі: [{ data: [50, 50, 25, 50, 25, 25] }],
            ВРМ: [{ data: [0, 50, 0, 0, 0, 0] }],
            ТП: [{ data: [100, 0, 0, 100, 100, 100] }],
          },
          Зарічанська: {
            Всі: [{ data: [100, 100, 0, 100, 0, 0] }],
          },
          Синевирська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Горінчівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Міжгірська: {
            Всі: [{ data: [100, 100, 100, 100, 100, 0] }],
          },
          Іршавська: {
            Всі: [{ data: [100, 100, 100, 0, 0, 0] }],
          },
          Білківська: {
            Всі: [{ data: [40, 20, 40, 20, 0, 0] }],
            ВРМ: [{ data: [25, 0, 25, 0, 0, 0] }],
          },
          Вишківська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Пилипецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Хустська: {
            Всі: [{ data: [100, 100, 100, 100, 0, 0] }],
          },
          Довжанська: {
            Всі: [{ data: [75, 50, 75, 50, 25, 0] }],
            ВРМ: [{ data: [66, 33, 100, 33, 0, 0] }],
          },
        },
      },
      type: "bar",
      aditionalSetings: {
        singleInfo: null,
        filterSelects: [
          {
            id: nanoid(),
            position: "1",
            title: "Райони",

            subSelect: {
              id: nanoid(),
              position: "2",
              title: "Громада",

              subSelect: {
                id: nanoid(),
                position: "3",
                title: "Тип",
              },
            },
          },
        ],
      },
    },
  },
  res1: {
    id: "d",
    size: "ml",
    location: { x: 0, y: 4 },
    title: "Перегляд по окремим районам та громадам",
    chartConfig: {
      options: {
        chart: {
          id: "bar-chart",
        },
        plotOptions: {
          bar: {
            horizontal: false,
          },
        },
        yaxis: {
          min: 0,
          max: 100,
        },
        xaxis: {
          categories: [
            "Вільний доступ до приміщення",
            "Пандус",
            "Місце для тимчасового перебування",
            "Сходи з поручнями",
            "Санітарні кімнати",
            "Обслуговування осіб з порушенням зору",
            "Обслуговування осіб з порушенням слуху",
          ],
          labels: {
            hideOverlappingLabels: true,
            maxHeight: 100,
            trim: true,
          },
        },
      },
      data: {
        Всі: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15, 5] }],
          },
        },
        Берігівський: {
          Всі: {
            Всі: [{ data: [0, 58, 41, 33, 50, 0, 0] }],
          },
          Великобийганська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Вилоцька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Виноградівська: {
            Всі: [{ data: [0, 100, 0, 0, 100, 0, 0] }],
          },
          Батівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Пийтерфолівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Королівська: {
            Всі: [{ data: [0, 100, 0, 0, 0, 0, 0] }],
          },
          Великоберезька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Камянська: {
            Всі: [{ data: [0, 0, 0, 0, 100, 0, 0] }],
          },
          Берегівська: {
            Всі: [{ data: [0, 100, 100, 0, 0, 0, 0] }],
          },
          Косоньска: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Мукачівський: {
          Всі: {
            Всі: [{ data: [0, 71, 68, 43, 53, 6, 3] }],
          },
          Івановецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Полянська: {
            Всі: [{ data: [0, 100, 33, 100, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 20, 100, 100, 0, 0] }],
          },
          Мукачівська: {
            Всі: [{ data: [0, 80, 86, 13, 33, 6, 6] }],
            ВРМ: [{ data: [0, 85, 85, 7, 28, 0, 0] }],
          },
          Верхньокоропецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Неліпинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Великолучівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Горондівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100, 0] }],
          },
          Жденіївська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Кольчинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Нижньоворітська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Свалявська: {
            Всі: [{ data: [0, 0, 100, 100, 0, 0, 0] }],
          },
          Чинадіївська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Воловецька: {
            Всі: [{ data: [0, 0, 100, 0, 100, 0, 0] }],
          },
        },
        Рахівський: {
          Всі: {
            Всі: [{ data: [0, 10, 30, 10, 10, 0, 10] }],
          },
          Великобичківська: {
            Всі: [{ data: [0, 0, 14, 0, 0, 0, 0] }],
          },
          Рахівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Ясінянська: {
            Всі: [{ data: [0, 0, 100, 0, 0, 0, 100] }],
          },
          Богданська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Тячівський: {
          Всі: {
            Всі: [{ data: [0, 71, 42, 57, 57, 7, 7] }],
          },
          "Усть-Чорнянська": {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Углянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Вільховецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Нересницька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Бедевлянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Тячівська: {
            Всі: [{ data: [0, 75, 25, 25, 75, 0, 0] }],
            ВРМ: [{ data: [0, 66, 0, 0, 66, 0, 0] }],
          },
          Солотвинська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Буштинська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 0, 0] }],
          },
          Дубівська: {
            Всі: [{ data: [0, 100, 50, 100, 50, 50, 50] }],
            ВРМ: [{ data: [0, 100, 0, 100, 0, 0, 0] }],
          },
          Тересвянська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
        },
        Ужгородський: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15, 6] }],
          },
          Оноківська: {
            Всі: [{ data: [0, 100, 0, 50, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 0, 0, 100, 0, 0] }],
          },
          Перечинська: {
            Всі: [{ data: [0, 60, 80, 20, 40, 0, 0] }],
            ВРМ: [{ data: [0, 50, 75, 0, 25, 0, 0] }],
          },
          "Турє-Реметівська": {
            Всі: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
          },
          Чопська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 100, 0] }],
          },
          Середнянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Сюртівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          "Дубриницько-Малоберезнянська": {
            Всі: [{ data: [0, 0, 100, 100, 100, 0, 0] }],
          },
          Костринська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Ставненьська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Ужгородська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 50, 50] }],
          },
          Холмківська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Баранинська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Великоберезнянська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 100, 0] }],
          },
          Великодобронська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Хустський: {
          Всі: {
            Всі: [{ data: [0, 57, 47, 47, 38, 14, 4] }],
          },
          Колочавська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Драгівська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Керецьківська: {
            Всі: [{ data: [0, 50, 50, 25, 50, 25, 25] }],
            ВРМ: [{ data: [0, 0, 50, 0, 0, 0, 0] }],
            ТП: [{ data: [0, 100, 0, 0, 100, 100, 100] }],
          },
          Зарічанська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
          },
          Синевирська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Горінчівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Міжгірська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100, 0] }],
          },
          Іршавська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Білківська: {
            Всі: [{ data: [0, 40, 20, 40, 20, 0, 0] }],
            ВРМ: [{ data: [0, 25, 0, 25, 0, 0, 0] }],
          },
          Вишківська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Пилипецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Хустська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Довжанська: {
            Всі: [{ data: [0, 75, 50, 75, 50, 25, 0] }],
            ВРМ: [{ data: [0, 66, 33, 100, 33, 0, 0] }],
          },
        },
      },
      type: "bar",
      aditionalSetings: {
        singleInfo: null,
        filterSelects: [
          {
            id: nanoid(),
            position: "1",
            title: "Райони",

            subSelect: {
              id: nanoid(),
              position: "2",
              title: "Громада",

              subSelect: {
                id: nanoid(),
                position: "3",
                title: "Тип",
              },
            },
          },
        ],
      },
    },
  },
  res2: {
    id: "e",
    size: "ml",
    location: { x: 6, y: 4 },
    title: "Наявні рішення для обслуговування осіб з порушенням зору",
    chartConfig: {
      options: {
        chart: {
          id: "bar-chart",
        },
        plotOptions: {
          bar: {
            horizontal: false,
          },
        },
        yaxis: {
          min: 0,
          max: 100,
        },
        xaxis: {
          categories: [
            "Маркування сходового маршуту",
            "Аудіопокажчик",
            "Дублювання шрифтом Брайля",
            "Таблички збільшеним шрифтом на входах",
            "Інформаційні термінали з дод. функцією",
            "Обслуговування осіб з порушенням зору",
            "Таблички у приміщенні",
          ],
          labels: {
            hideOverlappingLabels: true,
            maxHeight: 100,
            trim: true,
          },
        },
      },
      data: {
        Всі: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15, 5] }],
          },
        },
        Берігівський: {
          Всі: {
            Всі: [{ data: [0, 58, 41, 33, 50, 0, 0] }],
          },
          Великобийганська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Вилоцька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Виноградівська: {
            Всі: [{ data: [0, 100, 0, 0, 100, 0, 0] }],
          },
          Батівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Пийтерфолівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Королівська: {
            Всі: [{ data: [0, 100, 0, 0, 0, 0, 0] }],
          },
          Великоберезька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Камянська: {
            Всі: [{ data: [0, 0, 0, 0, 100, 0, 0] }],
          },
          Берегівська: {
            Всі: [{ data: [0, 100, 100, 0, 0, 0, 0] }],
          },
          Косоньска: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Мукачівський: {
          Всі: {
            Всі: [{ data: [0, 71, 68, 43, 53, 6, 3] }],
          },
          Івановецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Полянська: {
            Всі: [{ data: [0, 100, 33, 100, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 20, 100, 100, 0, 0] }],
          },
          Мукачівська: {
            Всі: [{ data: [0, 80, 86, 13, 33, 6, 6] }],
            ВРМ: [{ data: [0, 85, 85, 7, 28, 0, 0] }],
          },
          Верхньокоропецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Неліпинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Великолучівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Горондівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100, 0] }],
          },
          Жденіївська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Кольчинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Нижньоворітська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Свалявська: {
            Всі: [{ data: [0, 0, 100, 100, 0, 0, 0] }],
          },
          Чинадіївська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Воловецька: {
            Всі: [{ data: [0, 0, 100, 0, 100, 0, 0] }],
          },
        },
        Рахівський: {
          Всі: {
            Всі: [{ data: [0, 10, 30, 10, 10, 0, 10] }],
          },
          Великобичківська: {
            Всі: [{ data: [0, 0, 14, 0, 0, 0, 0] }],
          },
          Рахівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Ясінянська: {
            Всі: [{ data: [0, 0, 100, 0, 0, 0, 100] }],
          },
          Богданська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Тячівський: {
          Всі: {
            Всі: [{ data: [0, 71, 42, 57, 57, 7, 7] }],
          },
          "Усть-Чорнянська": {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Углянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Вільховецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Нересницька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Бедевлянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Тячівська: {
            Всі: [{ data: [0, 75, 25, 25, 75, 0, 0] }],
            ВРМ: [{ data: [0, 66, 0, 0, 66, 0, 0] }],
          },
          Солотвинська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Буштинська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 0, 0] }],
          },
          Дубівська: {
            Всі: [{ data: [0, 100, 50, 100, 50, 50, 50] }],
            ВРМ: [{ data: [0, 100, 0, 100, 0, 0, 0] }],
          },
          Тересвянська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
        },
        Ужгородський: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15, 6] }],
          },
          Оноківська: {
            Всі: [{ data: [0, 100, 0, 50, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 0, 0, 100, 0, 0] }],
          },
          Перечинська: {
            Всі: [{ data: [0, 60, 80, 20, 40, 0, 0] }],
            ВРМ: [{ data: [0, 50, 75, 0, 25, 0, 0] }],
          },
          "Турє-Реметівська": {
            Всі: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
            ВРМ: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
          },
          Чопська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 100, 0] }],
          },
          Середнянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Сюртівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          "Дубриницько-Малоберезнянська": {
            Всі: [{ data: [0, 0, 100, 100, 100, 0, 0] }],
          },
          Костринська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Ставненьська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Ужгородська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 50, 50] }],
          },
          Холмківська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Баранинська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Великоберезнянська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 100, 0] }],
          },
          Великодобронська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Хустський: {
          Всі: {
            Всі: [{ data: [0, 57, 47, 47, 38, 14, 4] }],
          },
          Колочавська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Драгівська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Керецьківська: {
            Всі: [{ data: [0, 50, 50, 25, 50, 25, 25] }],
            ВРМ: [{ data: [0, 0, 50, 0, 0, 0, 0] }],
            ТП: [{ data: [0, 100, 0, 0, 100, 100, 100] }],
          },
          Зарічанська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 0, 0] }],
          },
          Синевирська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Горінчівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Міжгірська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100, 0] }],
          },
          Іршавська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0, 0] }],
          },
          Білківська: {
            Всі: [{ data: [0, 40, 20, 40, 20, 0, 0] }],
            ВРМ: [{ data: [0, 25, 0, 25, 0, 0, 0] }],
          },
          Вишківська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Пилипецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
          Хустська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0, 0] }],
          },
          Довжанська: {
            Всі: [{ data: [0, 75, 50, 75, 50, 25, 0] }],
            ВРМ: [{ data: [0, 66, 33, 100, 33, 0, 0] }],
          },
        },
      },
      type: "bar",
      aditionalSetings: {
        singleInfo: null,
        filterSelects: [
          {
            id: nanoid(),
            position: "1",
            title: "Райони",

            subSelect: {
              id: nanoid(),
              position: "2",
              title: "Громада",

              subSelect: {
                id: nanoid(),
                position: "3",
                title: "Тип",
              },
            },
          },
        ],
      },
    },
  },
  res3: {
    id: "f",
    size: "ml",
    location: { x: 6, y: 4 },
    title: "Наявні рішення для обслуговування осіб з порушенням зору",
    chartConfig: {
      options: {
        chart: {
          id: "bar-chart",
        },
        plotOptions: {
          bar: {
            horizontal: false,
          },
        },
        yaxis: {
          min: 0,
          max: 100,
        },
        xaxis: {
          categories: [
            "Маркування сходового маршуту",
            "Аудіопокажчик",
            "Дублювання шрифтом Брайля",
            "Таблички збільшеним шрифтом на входах",
            "Інформаційні термінали з дод. функцією",
            "Таблички у приміщенні",
          ],
          labels: {
            hideOverlappingLabels: true,
            maxHeight: 100,
            trim: true,
          },
        },
      },
      data: {
        Всі: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15] }],
          },
        },
        Берігівський: {
          Всі: {
            Всі: [{ data: [0, 58, 41, 33, 50, 0] }],
          },
          Великобийганська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Вилоцька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Виноградівська: {
            Всі: [{ data: [0, 100, 0, 0, 100, 0] }],
          },
          Батівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Пийтерфолівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Королівська: {
            Всі: [{ data: [0, 100, 0, 0, 0, 0] }],
          },
          Великоберезька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Камянська: {
            Всі: [{ data: [0, 0, 0, 0, 100, 0] }],
          },
          Берегівська: {
            Всі: [{ data: [0, 100, 100, 0, 0, 0] }],
          },
          Косоньска: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Мукачівський: {
          Всі: {
            Всі: [{ data: [0, 71, 68, 43, 53, 6] }],
          },
          Івановецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Полянська: {
            Всі: [{ data: [0, 100, 33, 100, 100, 0] }],
            ВРМ: [{ data: [0, 100, 20, 100, 100, 0] }],
          },
          Мукачівська: {
            Всі: [{ data: [0, 80, 86, 13, 33, 6] }],
            ВРМ: [{ data: [0, 85, 85, 7, 28, 0] }],
          },
          Верхньокоропецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Неліпинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Великолучівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Горондівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100] }],
          },
          Жденіївська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Кольчинська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Нижньоворітська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Свалявська: {
            Всі: [{ data: [0, 0, 100, 100, 0, 0] }],
          },
          Чинадіївська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Воловецька: {
            Всі: [{ data: [0, 0, 100, 0, 100, 0] }],
          },
        },
        Рахівський: {
          Всі: {
            Всі: [{ data: [0, 10, 30, 10, 10, 0] }],
          },
          Великобичківська: {
            Всі: [{ data: [0, 0, 14, 0, 0, 0] }],
          },
          Рахівська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Ясінянська: {
            Всі: [{ data: [0, 0, 100, 0, 0, 0] }],
          },
          Богданська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Тячівський: {
          Всі: {
            Всі: [{ data: [0, 71, 42, 57, 57, 7] }],
          },
          "Усть-Чорнянська": {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Углянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Вільховецька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Нересницька: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Бедевлянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Тячівська: {
            Всі: [{ data: [0, 75, 25, 25, 75, 0] }],
            ВРМ: [{ data: [0, 66, 0, 0, 66, 0] }],
          },
          Солотвинська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0] }],
          },
          Буштинська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 0] }],
          },
          Дубівська: {
            Всі: [{ data: [0, 100, 50, 100, 50, 50] }],
            ВРМ: [{ data: [0, 100, 0, 100, 0, 0] }],
          },
          Тересвянська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
        },
        Ужгородський: {
          Всі: {
            Всі: [{ data: [0, 60, 50, 40, 60, 15] }],
          },
          Оноківська: {
            Всі: [{ data: [0, 100, 0, 50, 100, 0] }],
            ВРМ: [{ data: [0, 100, 0, 0, 100, 0] }],
          },
          Перечинська: {
            Всі: [{ data: [0, 60, 80, 20, 40, 0] }],
            ВРМ: [{ data: [0, 50, 75, 0, 25, 0] }],
          },
          "Турє-Реметівська": {
            Всі: [{ data: [0, 100, 100, 0, 100, 0] }],
            ВРМ: [{ data: [0, 100, 100, 0, 100, 0] }],
          },
          Чопська: {
            Всі: [{ data: [0, 100, 0, 100, 100, 100] }],
          },
          Середнянська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Сюртівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          "Дубриницько-Малоберезнянська": {
            Всі: [{ data: [0, 0, 100, 100, 100, 0] }],
          },
          Костринська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Ставненьська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Ужгородська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 50] }],
          },
          Холмківська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Баранинська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Великоберезнянська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 100] }],
          },
          Великодобронська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
        },
        Хустський: {
          Всі: {
            Всі: [{ data: [0, 57, 47, 47, 38, 14] }],
          },
          Колочавська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Драгівська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0] }],
          },
          Керецьківська: {
            Всі: [{ data: [0, 50, 50, 25, 50, 25] }],
            ВРМ: [{ data: [0, 0, 50, 0, 0, 0] }],
            ТП: [{ data: [0, 100, 0, 0, 100, 100] }],
          },
          Зарічанська: {
            Всі: [{ data: [0, 100, 100, 0, 100, 0] }],
          },
          Синевирська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Горінчівська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Міжгірська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 100] }],
          },
          Іршавська: {
            Всі: [{ data: [0, 100, 100, 100, 0, 0] }],
          },
          Білківська: {
            Всі: [{ data: [0, 40, 20, 40, 20, 0] }],
            ВРМ: [{ data: [0, 25, 0, 25, 0, 0] }],
          },
          Вишківська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Пилипецька: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0] }],
          },
          Хустська: {
            Всі: [{ data: [0, 100, 100, 100, 100, 0] }],
          },
          Довжанська: {
            Всі: [{ data: [0, 75, 50, 75, 50, 25] }],
            ВРМ: [{ data: [0, 66, 33, 100, 33, 0] }],
          },
        },
      },
      type: "bar",
      aditionalSetings: {
        singleInfo: null,
        filterSelects: [
          {
            id: nanoid(),
            position: "1",
            title: "Райони",

            subSelect: {
              id: nanoid(),
              position: "2",
              title: "Громада",

              subSelect: {
                id: nanoid(),
                position: "3",
                title: "Тип",
              },
            },
          },
        ],
      },
    },
  },
  res4: {
    id: "g",
    size: "ml",
    location: { x: 0, y: 7 },
    title: "Наявні рішення для обслуговування осіб з порушенням слуху",
    chartConfig: {
      options: {
        chart: {
          id: "bar-chart",
        },
        plotOptions: {
          bar: {
            horizontal: false,
          },
        },
        yaxis: {
          min: 0,
          max: 100,
        },
        xaxis: {
          categories: [
            "Можливість встановлення відеозвʼязку з перекладачем",
            "Термінали з підсиленням звуку",
            "Система керування чергою",
          ],
          labels: {
            hideOverlappingLabels: true,
            maxHeight: 100,
            trim: true,
          },
        },
      },
      data: {
        Всі: {
          Всі: {
            Всі: [{ data: [0, 60, 50] }],
          },
        },
        Берігівський: {
          Всі: {
            Всі: [{ data: [0, 58, 41] }],
          },
          Великобийганська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Вилоцька: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Виноградівська: {
            Всі: [{ data: [0, 100, 0] }],
          },
          Батівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Пийтерфолівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Королівська: {
            Всі: [{ data: [0, 100, 0] }],
          },
          Великоберезька: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Камянська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Берегівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Косоньска: {
            Всі: [{ data: [0, 0, 0] }],
          },
        },
        Мукачівський: {
          Всі: {
            Всі: [{ data: [0, 71, 68] }],
          },
          Івановецька: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Полянська: {
            Всі: [{ data: [0, 100, 33] }],
            ВРМ: [{ data: [0, 100, 20] }],
          },
          Мукачівська: {
            Всі: [{ data: [0, 80, 86] }],
            ВРМ: [{ data: [0, 85, 85] }],
          },
          Верхньокоропецька: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Неліпинська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Великолучівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Горондівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Жденіївська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Кольчинська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Нижньоворітська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Свалявська: {
            Всі: [{ data: [0, 0, 100] }],
          },
          Чинадіївська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Воловецька: {
            Всі: [{ data: [0, 0, 100] }],
          },
        },
        Рахівський: {
          Всі: {
            Всі: [{ data: [0, 10, 30] }],
          },
          Великобичківська: {
            Всі: [{ data: [0, 0, 14] }],
          },
          Рахівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Ясінянська: {
            Всі: [{ data: [0, 0, 100] }],
          },
          Богданська: {
            Всі: [{ data: [0, 0, 0] }],
          },
        },
        Тячівський: {
          Всі: {
            Всі: [{ data: [0, 71, 42] }],
          },
          "Усть-Чорнянська": {
            Всі: [{ data: [0, 0, 0] }],
          },
          Углянська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Вільховецька: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Нересницька: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Бедевлянська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Тячівська: {
            Всі: [{ data: [0, 75, 25] }],
            ВРМ: [{ data: [0, 66, 0] }],
          },
          Солотвинська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Буштинська: {
            Всі: [{ data: [0, 100, 0] }],
          },
          Дубівська: {
            Всі: [{ data: [0, 100, 50] }],
            ВРМ: [{ data: [0, 100, 0] }],
          },
          Тересвянська: {
            Всі: [{ data: [0, 100, 100] }],
          },
        },
        Ужгородський: {
          Всі: {
            Всі: [{ data: [0, 60, 50] }],
          },
          Оноківська: {
            Всі: [{ data: [0, 100, 0] }],
            ВРМ: [{ data: [0, 100, 0] }],
          },
          Перечинська: {
            Всі: [{ data: [0, 60, 80] }],
            ВРМ: [{ data: [0, 50, 75] }],
          },
          "Турє-Реметівська": {
            Всі: [{ data: [0, 100, 100] }],
            ВРМ: [{ data: [0, 100, 100] }],
          },
          Чопська: {
            Всі: [{ data: [0, 100, 0] }],
          },
          Середнянська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Сюртівська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          "Дубриницько-Малоберезнянська": {
            Всі: [{ data: [0, 0, 100] }],
          },
          Костринська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Ставненьська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Ужгородська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Холмківська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Баранинська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Великоберезнянська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Великодобронська: {
            Всі: [{ data: [0, 0, 0, 0, 0, 0, 0] }],
          },
        },
        Хустський: {
          Всі: {
            Всі: [{ data: [0, 57, 47] }],
          },
          Колочавська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Драгівська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Керецьківська: {
            Всі: [{ data: [0, 50, 50] }],
            ВРМ: [{ data: [0, 0, 50] }],
            ТП: [{ data: [0, 100, 0] }],
          },
          Зарічанська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Синевирська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Горінчівська: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Міжгірська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Іршавська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Білківська: {
            Всі: [{ data: [0, 40, 20] }],
            ВРМ: [{ data: [0, 25, 0] }],
          },
          Вишківська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Пилипецька: {
            Всі: [{ data: [0, 0, 0] }],
          },
          Хустська: {
            Всі: [{ data: [0, 100, 100] }],
          },
          Довжанська: {
            Всі: [{ data: [0, 75, 50] }],
            ВРМ: [{ data: [0, 66, 33] }],
          },
        },
      },
      type: "bar",
      aditionalSetings: {
        singleInfo: null,
        filterSelects: [
          {
            id: nanoid(),
            position: "1",
            title: "Райони",

            subSelect: {
              id: nanoid(),
              position: "2",
              title: "Громада",

              subSelect: {
                id: nanoid(),
                position: "3",
                title: "Тип",
              },
            },
          },
        ],
      },
    },
  },
};
